<template>
  <footer class="bg-gray-800 p-6 mt-8 shadow-inner">
    <div class="mb-4 mx-auto text-center text-gray-400">
      <div class="flex justify-center space-x-6">
        <img
          src="../../assets/img/webstudio_logo.png"
          alt="Постер"
          class="w-20 h-15 object-cover rounded mr-3" />
      </div>

      <p class="mb-4">
        &copy; {{ new Date().getFullYear() }} All rights reserved.
      </p>

      <!-- Ссылки на социальные сети -->
      <div class="flex justify-center space-x-6">
        <a
          href="#"
          class="text-gray-400 hover:text-white transition-colors duration-200">
          <svg
            class="w-6 h-6"
            fill="currentColor"
            viewBox="0 0 24 24"
            aria-hidden="true">
            <path
              fill-rule="evenodd"
              d="M22 12c0-5.523-4.477-10-10-10S2 6.477 2 12c0 4.991 3.657 9.128 8.438 9.878v-6.987h-2.54V12h2.54V9.797c0-2.506 1.492-3.89 3.777-3.89 1.094 0 2.238.195 2.238.195v2.46h-1.26c-1.243 0-1.63.771-1.63 1.562V12h2.773l-.443 2.89h-2.33V22C18.343 21.128 22 16.991 22 12z"
              clip-rule="evenodd" />
          </svg>
        </a>
        <a
          href="#"
          class="text-gray-400 hover:text-white transition-colors duration-200">
          <svg
            class="w-6 h-6"
            fill="currentColor"
            viewBox="0 0 24 24"
            aria-hidden="true">
            <path
              fill-rule="evenodd"
              d="M12.315 2c2.43 0 2.784.013 3.715.058.937.046 1.504.194 1.972.386.464.192.86.499 1.127.864.267.363.594.796.934 1.136.34.34.767.667 1.136.934.37.267.673.663.865 1.127.192.464.334 1.03.386 1.972.045.93.058 1.286.058 3.715s-.013 2.784-.058 3.715c-.046.937-.194 1.504-.386 1.972a3.916 3.916 0 01-.864 1.127c-.363.267-.796.594-1.136.934-.34.34-.667.767-.934 1.136a3.916 3.916 0 01-1.127.865c-.464.192-1.03.334-1.972.386-.93.045-1.286.058-3.715.058s-2.784-.013-3.715-.058c-.937-.046-1.504-.194-1.972-.386a3.916 3.916 0 01-1.127-.864c-.267-.363-.594-.796-.934-1.136-.34-.34-.767-.667-1.136-.934a3.916 3.916 0 01-.865-1.127c-.192-.464-.334-1.03-.386-1.972C2.013 14.315 2 13.96 2 12.315s.013-2.784.058-3.715c.046-.937.194-1.504.386-1.972a3.916 3.916 0 01.864-1.127c.267-.363.594-.796.934-1.136.34-.34.667-.767.934-1.136.267-.37.663-.673 1.127-.865.464-.192 1.03-.334 1.972-.386C9.685 2.013 10.04 2 12.315 2zm0 0"
              clip-rule="evenodd" />
          </svg>
        </a>
        <a
          href="#"
          class="text-gray-400 hover:text-white transition-colors duration-200">
          <svg
            class="w-6 h-6"
            fill="currentColor"
            viewBox="0 0 24 24"
            aria-hidden="true">
            <path
              d="M8.29 20.251c7.547 0 11.675-6.253 11.675-11.675 0-.178 0-.355-.007-.532A8.318 8.318 0 0022 5.92a8.19 8.19 0 01-2.357.646 4.118 4.118 0 001.804-2.27 8.224 8.224 0 01-2.605.996 4.107 4.107 0 00-6.993 3.743 11.65 11.65 0 01-8.457-4.287 4.106 4.106 0 001.27 5.477A4.073 4.073 0 01.8 10.792v.05c0 4.477 3.185 8.197 7.462 9.096a4.109 4.109 0 01-1.844.07 4.106 4.106 0 003.834 2.85A8.233 8.233 0 012 18.407a11.616 11.616 0 006.29 1.844" />
          </svg>
        </a>
      </div>
    </div>
  </footer>
</template>

<script setup></script>

<style scoped></style>
